In [16]:
import sys
from pathlib import Path

sys.path.append(str(Path().resolve().parents[0]))
from model_training_src.cleaner import DataCleaner


import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns


import warnings
warnings.filterwarnings("ignore")

## Data Loading & Inspection

In [3]:
# project root
project_root = Path().resolve().parents[0]   # specify the root path which is one level above the current working directory

# data paths
data_path1 = project_root /"data" / "Existing Staff.csv"
data_path2 = project_root /"data"/"Exited Staff.csv"

# into dataframes
df_1 = pd.read_csv(data_path1)
df_2 = pd.read_csv(data_path2)

In [4]:
# display df_existing
df_1.head()

,S/N,Job Title,Department,Age,Gender,Marital Status,Years of Service,Salary
0,1,HR Specialist,Human Resources,25,Male,Married,2,537.25
1,2,Project Manager,Sales & Marketing,53,Male,Single,8,154.13
2,3,Billing Specialist,IT & Software,44,Female,Married,8,368.54
3,4,Marketing Analyst,Data Analytics,37,Female,Married,7,269.92
4,5,Product Manager,IT & Software,30,Male,Single,4,131.17

In [5]:
# display df_exit
df_2.head()

,Job Title,Department,Age,Gender,Marital Status,Years of Service,Mode of Exit,Date of Exit,Reasons For Exit,Salary
0,Marketing Analyst,Field Operations,31,Female,Single,4,Termination,9/30/2024,Policy violation,338.541667
1,Marketing Analyst,Field Operations,60,Female,Single,6,Retirement,8/21/2023,Work-life balance,357.333333
2,Marketing Analyst,Sales & Marketing,60,Male,Married,5,Retirement,1/11/2024,End of service,594.416667
3,Software Developer,Data Analytics,26,Female,Married,7,Termination,5/2/2023,End of service,439.583333
4,Sales Executive,Project Management,60,Female,Married,2,Retirement,2/14/2024,Policy violation,737.916667

In [6]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   S/N               3500 non-null   int64
 1   Job Title         3500 non-null   object
 2   Department        3500 non-null   object
 3   Age               3500 non-null   int64
 4   Gender            3500 non-null   object
 5   Marital Status    3500 non-null   object
 6   Years of Service  3500 non-null   int64
 7   Salary            3500 non-null   float64
dtypes: float64(1), int64(3), object(4)
memory usage: 218.9+ KB

In [7]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 820 entries, 0 to 819
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Job Title         820 non-null    object
 1   Department        820 non-null    object
 2   Age               820 non-null    int64
 3   Gender            820 non-null    object
 4   Marital Status    820 non-null    object
 5   Years of Service  820 non-null    int64
 6   Mode of Exit      820 non-null    object
 7   Date of Exit      820 non-null    object
 8   Reasons For Exit  820 non-null    object
 9   Salary            820 non-null    float64
dtypes: float64(1), int64(2), object(7)
memory usage: 64.2+ KB

## Summary statistics

In [13]:
# print summary statistics of both datasets
print("Summary Statistics for Existing Staff:") 
df_1.describe(include='all').T

Summary Statistics for Existing Staff:

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
S/N,3500.0,NaN,NaN,NaN,1750.5,1010.507298,1.0,875.75,1750.5,2625.25,3500.0
Job Title,3500,12,Customer Support Agent,314,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Department,3500,9,Human Resources,423,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,3500.0,NaN,NaN,NaN,39.055714,10.899921,22.0,29.0,39.0,49.0,58.0
Gender,3500,2,Female,1758,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marital Status,3500,2,Married,1777,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Years of Service,3500.0,NaN,NaN,NaN,5.000571,2.220871,1.0,3.0,5.0,7.0,8.0
Salary,3500.0,NaN,NaN,NaN,357.746777,133.120345,125.08,260.1975,348.63,438.5825,749.08

In [11]:
print("\nSummary Statistics for Exited Staff:")
df_2.describe(include='all').T

Summary Statistics for Exited Staff:

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Job Title,820,12,Marketing Analyst,83,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Department,820,9,Billing,103,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,820.0,NaN,NaN,NaN,47.307317,12.603106,22.0,37.0,50.0,60.0,60.0
Gender,820,2,Female,413,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marital Status,820,2,Single,414,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Years of Service,820.0,NaN,NaN,NaN,4.842683,2.551235,1.0,2.0,4.0,7.0,10.0
Mode of Exit,820,3,Resignation,296,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Date of Exit,820,497,12/19/2024,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Reasons For Exit,820,9,Better opportunity,105,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Salary,820.0,NaN,NaN,NaN,351.067581,134.754053,125.333333,248.697917,339.770833,433.625,737.916667

In [18]:
# instanciate the DataCleaner class

cleaner = DataCleaner(df_1, drop_columns=['S/N'])

df_1_cleaned = cleaner.clean()
df_1_cleaned.info()

TypeError: DataCleaner.__init__() got an unexpected keyword argument 'drop_columns'

In [15]:
help(DataCleaner)

Help on class DataCleaner in module model_training_src.cleaner:

class DataCleaner(builtins.object)
 |  DataCleaner(
 |      df: pandas.core.frame.DataFrame,
 |      drop_duplicates: bool = True,
 |      handle_missing: str = 'auto',
 |      text_cleanup: bool | list = True,
 |      numeric_outliers: bool = True,
 |      outlier_method: str = 'cap',
 |      iqr_multiplier: float = 1.5,
 |      category_threshold: int = 10,
 |      verbose: bool = True,
 |      missing_categorical_value: str = 'MISSING'
 |  )
 |
 |  Comprehensive data cleaning pipeline for pandas DataFrames using OOP approach
 |
 |  Features:
 |  - Duplicate removal
 |  - Text standardization
 |  - Missing value handling
 |  - Outlier management
 |  - Data type optimization
 |  - Detailed cleaning reports
 |
 |
 |  Usage:
 |  >>> cleaner = DataCleaner(df)
 |  >>> cleaned_df = cleaner.clean()
 |  >>> report = cleaner.report()
 |
 |  Methods defined here:
 |
 |  __init__(
 |      self,
 |      df: pandas.core.frame.DataFrame,
 |      drop_duplicates: bool = True,
 |      handle_missing: str = 'auto',
 |      text_cleanup: bool | list = True,
 |      numeric_outliers: bool = True,
 |      outlier_method: str = 'cap',
 |      iqr_multiplier: float = 1.5,
 |      category_threshold: int = 10,
 |      verbose: bool = True,
 |      missing_categorical_value: str = 'MISSING'
 |  )
 |      Initialize data cleaner with configuration options
 |
 |      Args:
 |          df: Input DataFrame to clean
 |
 |          drop_duplicates: Remove duplicate rows (default: True)
 |          use case: drop_duplicates=True  :- will remove exact duplicate rows
 |
 |          handle_missing: Strategy for missing values:
 |              'auto' (median/mode), 'drop', 'fill' (mean/string), 'skip'
 |          1. 'auto' - Automatically fills numeric with median, categorical with mode
 |          2. 'drop' - Drops rows with any missing values
 |          3. 'fill' - Fills numeric with mean, categorical with a specified value
 |          4. 'skip' - Skips missing value handling, useful for exploratory analysis
 |          use case: handle_missing='auto'
 |
 |
 |          text_cleanup: Text cleaning: True (defaults), False, or list of operations:
 |              ['strip', 'lowercase', 'remove_special', 'normalize_unicode']
 |
 |          numeric_outliers: Handle numeric outliers (default: True)
 |
 |          outlier_method: 'cap' (winsorize) or 'remove' (delete rows)
 |
 |          iqr_multiplier: IQR multiplier for outlier detection
 |
 |          category_threshold: Unique value threshold for categorical conversion
 |
 |          verbose: Print processing details
 |
 |          missing_categorical_value: Fill value for categorical NaNs
 |
 |  clean(self) -> pandas.core.frame.DataFrame
 |      Execute the full cleaning pipeline
 |
 |  get_config(self) -> dict
 |      Get current configuration settings
 |
 |  log(self, message: str)
 |      Conditional logging based on verbose setting
 |
 |  report(self) -> dict
 |      Get detailed cleaning report
 |
 |  reset(self)
 |      Reset to original data while keeping configuration
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables
 |
 |  __weakref__
 |      list of weak references to the object